---
kind: type
id: T:Autodesk.Revit.DB.PartEdgeConditionOrientation
source: html/da54576e-5aa4-7886-4bcf-0ad11b3c6a49.htm
---
# Autodesk.Revit.DB.PartEdgeConditionOrientation

Relative orientation of the right/lower and left/upper edge condition profiles.

## Syntax (C#)
```csharp
public enum PartEdgeConditionOrientation
```

## Remarks
A family-based profile defines the shape of the left/upper profile and this
 value defines how a matching right/lower profile is obtained.